--▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬
--
--			  ███████	████████████	████████	███████		████████	███████		████████████	██				███████			  ██████████	████████
--			  ██			 ██			██	  ██	██			██	  ██	██			     ██    		██				██ 				  ██	  ██	██	  ██
--			  ██			 ██			██	  ██	██			██    ██	██			     ██			██				██				  ██	  ██	██	  ██
--			  ███████	 	 ██			████████	███████		████████	███████	         ██ 		██				███████			  ██████████	████████
--				   ██		 ██			██  ██		██			██				 ██	         ██			██					 ██			  ██  ██		██
--				   ██ 		 ██			██  ██		██			██				 ██	         ██ 		██ 				     ██   		  ██  ██		██
--			  ███████		 ██			██	████	███████		██			███████		████████████	███████████		███████			  ██  ██████	██
--																																								By Aniol0012
--▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬▬
-- TriggerEvent('esx_policedog:openMenu') para triggerear el menú.

Config = {
    Job = {'police', 'admin'},
    Command = '', -- Poner en falso para que no haya comando
    Model = 1318032802, -- 351016938
    TpDistance = 50.0,
    Sit = {
        dict = 'creatures@rottweiler@amb@world_dog_sitting@base',
        anim = 'base'
    },
    Drugs = {'lsd_pooch', 'coke_pooch', 'meth_pooch', 'weed_pooch'}, -- Añadir aquí las drogas para detectar
}

Strings = {
    ['not_police'] = '¡No eres policia!',
    ['menu_title'] = '🐶 <span style="color:moccasin;">Perro policial',
    ['take_out_remove'] = '<span style="color:lightgreen;">Sacar al perro <span style="color:white;">| <span style="color:red;">Poner el perro en su caseta',
    ['deleted_dog'] = 'Enviando el perro a su caseta',
    ['spawned_dog'] = 'Llamando al perro...',
    ['sit_stand'] = '<span style="color:slateblue;">Hacer que se quede contigo',
    ['no_dog'] = "No tienes ningún perro",
    ['dog_dead'] = 'Tu perro está mueto',
    ['search_drugs'] = '<span style="color:yellow;">Buscar drogas',
    ['no_drugs'] = 'No hay drogas que buscar.', 
    ['drugs_found'] = 'El perro ha encontrado drogas',
    ['dog_too_far'] = 'El perro está demasiado lejos',
    ['attack_closest'] = '<span style="color:orange;">Atacar a un jugador cercano'
}